# Урок 1. Ввод-Вывод, операторы ветвления

`Усложнение задач выделены (*). Они необязательны для решения и нужны для тех, кому мало выполнить обычное задание.
Если вы хотите решить усложненное задание - сначала сделайте задание обычной сложности.`

### **1.1[2].**
 Найдите сумму цифр трехзначного числа. Используйте f-строки чтобы оформить красивый вывод. Например для числа 145 сумма цифр будет 10: 1 + 4 + 5

### Примеры/Тесты:
123 >>> Сумма чисел числа 123 равна 6

100 >>> Сумма чисел числа 100 равна 1

`(*) Усложнение. Решите для числа произвольной разрядности: произвольное количество цифр в числе.`

```python
num = input("Введите трехзначное число = ")
sum_num = int(num[0])

for el in num[1:]:
    sum_num += int(el)

print(f"Сумма всех цифр числа {num} = {sum_num}")
```

`(**) Усложнение. Для числа произвольной разрядности добавить в вывод строку с числами, например так:
13579 >>> Сумма чисел числа 13579 равна 25(1 + 3 + 5 + 7 + 9)`

```python
# Вывод будет иметь такой вид
digits_str = " + ".join(num)
print(f"Сумма всех цифр числа {num} = {digits_str} = {sum_num} ")
```

`Мое первое решение, которое я сделал будучи в другой группе 
Тут я сделал проверку на ввод`

```python
while True:
    num = input("Введите трехзначное число = ")
    if num == "q":
        break
    if num.isdigit() and len(num) == 3:
        sum = 0
        for i in num:
            sum  += int(i)
        print(f"{sum}")
        break
    else:
        print(""" Что то пошло не так, убедитесь что:
        1)число нужной длинны;
        2)число состоит только из цифр.
        \n Для выхода из программы нажмите 'q'""")
```

### **1.2[4].** 
Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов. Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа делали одинаковое количество журавликов, а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?

### Примеры/Тесты:

6 >>>  1  4  1

24 >>> 4  16  4

60 >>> 10  40  10


```python
S = int(input("Всего сделанных журавликов = "))
petia = serj = 1
katia = (petia + serj)*2
all = petia+serj+katia

if S % all == 0:
    coef = S // all
    print(f"""
Итого:
Петя сделал {petia * coef} журавликов;
Катя сделала {katia * coef} журавликов;
Серёжа сделал {serj * coef} журавликов.
""")
else:
    print("Невозможно посчитать")
```

### **1.3[6].**
Вы пользуетесь общественным транспортом? Вероятно, вы расплачивались за проезд и получали билет с номером.Счастливым билетом называют такой билет с шестизначным номером, где сумма первых трех цифр равна сумме последних трех. Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6. Вам требуется написать программу, которая проверяет счастливость билета.

### Примеры/Тесты:

385916 >>> yes

123456 >>> no
```python
ticket = input("Число в билете = ")
first_symbol = 0
end_symbol = 0

for el in ticket[:3]:
    first_symbol += int(el)
for el in ticket[-3:]:
    end_symbol += int(el)

if first_symbol == end_symbol:
    print("Ура у вас счастливый билет")
else:
    print("Ваш билет не счастливый")
```
`(*) Усложнение. Вывод результат на экран сделайте одной 
строкой(только один print), для этого используйте 
тернарный оператор`
```python
print("Ура у вас счастливый билет" if first_symbol == end_symbol else "Ваш билет обычный:(")
```


### **1.4[8].** 
Требуется определить, можно ли от шоколадки размером n × m долек отломить k долек, если разрешается сделать один разлом по прямой между дольками (то есть разломить шоколадку на два прямоугольника).

### Примеры/Тесты:

3 2 4 -> yes

3 2 1 -> no

```python
n = int(input("Дольки по вертикали = "))
m = int(input("Дольки по горизонтали = "))
k = int(input("Сколько отломить? = "))

# Сначала проверка на то что k не превышает колличество долек
# Далее проверяем можно ли разбить ровным прямоугольником
if k <= n * m and (k % n == 0 or k % m == 0):
    print("yes")
else:
    print("no")
```


